index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-04-19 04:34 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>test for ox-w3ctr.el</title>
<meta name="generator" content="Org Mode">
<link rel="icon" type="image/png" sizes="192x192" href="./lili.png">
</head>
<body class="toc-inline">
<p id="toc-nav">
<a id="toc-jump" href="#toc">
<span aria-hidden="true">↑</span>
<span>Jump to Table of Contents</span>
</a>
<a id="toc-toggle" href="#toc">
<span aria-hidden="true">→</span>
<span>Pop Out Sidebar</span>
</a>
</p><div class="head">
<header>
<h1 id="title">test for ox-w3ctr.el</h1>
<p id="w3c-state">let's test the subtitle</p>
</header>
<details open>
<summary>More details about this document</summary>
<dl>
<dt>Create Date:</dt> <dd><time datetime="2024-04-18T16:27Z">[2024-04-19 01:27]</time></dd>
<dt>Publish Date:</dt> <dd><time datetime="2024-04-18T16:27Z">[2024-04-19 01:27]</time></dd>
<dt>Update Date:</dt> <dd>2024-04-19 04:34</dd>
<dt>Creator:</dt> <dd><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.2 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</dd>
<dt>License:</dt> <dd>This work is licensed under <a href="https://creativecommons.org/licenses/by-sa/4.0/">CC BY-SA 4.0</a></dd>
</dl>
</details>
<hr>

</div>
<div id="abstract">
<p>
本文档是对 ox-w3ctr.el 这一 org 文档导出后端的测试，这一节属于 zeroth section，我采用了不同于 ox-html 的处理方法。
</p>

<p>
Let's Start.
</p>
</div>
<nav id="toc" data-count="10">
<h2 id="table-of-contents">Table of Contents</h2>

<ul class="toc">
<li class="tocline"><a href="#abstract">Abstract</a></li>
<li class="tocline"><a href="#orgnh-1"><span class="secno">1</span>关于本文档的说明</a></li>
<li class="tocline"><a href="#orgnh-2"><span class="secno">2</span>测试 headline</a>
<ul class="toc">
<li class="tocline"><a href="#orgnh-2.1"><span class="secno">2.1</span>我是二级标题</a>
<ul class="toc">
<li class="tocline"><a href="#orgnh-2.1.1"><span class="secno">2.1.1</span>我是三级标题</a>
<ul class="toc">
<li class="tocline"><a href="#orgnh-2.1.1.1"><span class="secno">2.1.1.1</span>我是四级标题</a>
<ul class="toc">
<li class="tocline"><a href="#orgnh-2.1.1.1.1"><span class="secno">2.1.1.1.1</span>我是五级标题</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li class="tocline"><a href="#orgnh-2.2"><span class="secno">2.2</span>（为了没有缩进，从二级标题开始）</a></li>
</ul>
</li>
<li class="tocline"><a href="#orgnh-3"><span class="secno">3</span>center-block, quote-block, special-block</a></li>
<li class="tocline"><a href="#orgnh-4"><span class="secno">4</span>drawers</a></li>
</ul>
</nav>
<script>
(function() {
   'use strict'
    window.addEventListener('load', () => {
	let tocToggle = document.getElementById('toc-toggle')
	let arrow = tocToggle.children[0]
	let text = tocToggle.children[1]
	let myclass = document.body.classList

	let fontSize = window.getComputedStyle(document.documentElement).fontSize
	let pixWidth = parseFloat(fontSize)
	let widthEm = window.innerWidth / pixWidth
	let tocCount = document.getElementById('toc').dataset.count
	if (widthEm > 80 && tocCount >= 5) {
	    myclass.remove('toc-inline')
	    myclass.add('toc-sidebar')
	    arrow.innerHTML = '←'
	    text.innerHTML = 'Collapse Sidebar'
	}
	tocToggle.addEventListener('click', () => {
	    if (myclass.contains('toc-inline')) {
		myclass.remove('toc-inline')
		myclass.add('toc-sidebar')
		arrow.innerHTML = '←'
		text.innerHTML = 'Collapse Sidebar'
	    } else if (myclass.contains('toc-sidebar')) {
		myclass.remove('toc-sidebar')
		myclass.add('toc-inline')
		arrow.innerHTML = '→'
		text.innerHTML = 'Pop Out Sidebar'
	    }
	})
    })
})()

</script>
<main>

<section id="orgnh-1"><div class="header-wrapper">
<h2 id="x-orgnh-1"><span class="secno">1. </span>关于本文档的说明</h2>
<a class="self-link" href="#orgnh-1" aria-label="Permalink for Section 1"></a>
</div>
<p>
严格来说，想要测试 ox-w3ctr 是否可用，我应该编写一些测试样例，但是 org 的导出框架已经足够鲁棒，如果在使用中碰到问题很容易进行修正，而且一些不常用功能中的 bug 如果不使用根本不会发现，因此我只编写了这一个简单的测试文件，在其中，我会测试几乎所有 ox-w3ctr 提供的导出元素功能，以及一些由 W3C 技术报告文档 CSS 提供的类。
</p>

<p>
本文所使用的 CSS 文件来自 W3C TR 2021，即 <a href="https://www.w3.org/StyleSheets/TR/2021/">https://www.w3.org/StyleSheets/TR/2021/</a> 中的 <a href="https://www.w3.org/StyleSheets/TR/2021/base.css">base.css</a>。最新的 base.css 可从该 CSS 的 github <a href="https://github.com/w3c/tr-design">repo</a> 获取。以下 W3C TR 可以作为简单用例：
</p>

<ul class="org-ul">
<li><a href="https://www.w3.org/TR/CSP3/">https://www.w3.org/TR/CSP3/</a></li>
<li><a href="https://www.w3.org/TR/selectors-4/">https://www.w3.org/TR/selectors-4/</a></li>
<li><a href="https://respec.org/docs/">https://respec.org/docs/</a></li>
<li><a href="https://www.w3.org/TR/rdf12-concepts/">https://www.w3.org/TR/rdf12-concepts/</a></li>
</ul>

<p>
关于 org 的语法以及导出框架，可以参考以下资料：
</p>

<ul class="org-ul">
<li><a href="https://orgmode.org/worg/org-syntax.html">https://orgmode.org/worg/org-syntax.html</a></li>
<li><a href="https://orgmode.org/worg/dev/org-element-api.html">https://orgmode.org/worg/dev/org-element-api.html</a></li>
<li><a href="https://orgmode.org/worg/dev/org-export-reference.html">https://orgmode.org/worg/dev/org-export-reference.html</a></li>
</ul>
</section>

<section id="orgnh-2"><div class="header-wrapper">
<h2 id="x-orgnh-2"><span class="secno">2. </span>测试 headline</h2>
<a class="self-link" href="#orgnh-2" aria-label="Permalink for Section 2"></a>
</div>
<p>
<code>ox-w3ctr</code> 支持 <code>*</code> 到 <code>*****</code> 这些标题，高于五级的 headline 将会以列表的形式出现。以下是二到五级标题：
</p>

<section id="orgnh-2.1"><div class="header-wrapper">
<h3 id="x-orgnh-2.1"><span class="secno">2.1. </span>我是二级标题</h3>
<a class="self-link" href="#orgnh-2.1" aria-label="Permalink for Section 2.1"></a>
</div>
<section id="orgnh-2.1.1"><div class="header-wrapper">
<h4 id="x-orgnh-2.1.1"><span class="secno">2.1.1. </span>我是三级标题</h4>
<a class="self-link" href="#orgnh-2.1.1" aria-label="Permalink for Section 2.1.1"></a>
</div>
<section id="orgnh-2.1.1.1"><div class="header-wrapper">
<h5 id="x-orgnh-2.1.1.1"><span class="secno">2.1.1.1. </span>我是四级标题</h5>
<a class="self-link" href="#orgnh-2.1.1.1" aria-label="Permalink for Section 2.1.1.1"></a>
</div>
<section id="orgnh-2.1.1.1.1"><div class="header-wrapper">
<h6 id="x-orgnh-2.1.1.1.1"><span class="secno">2.1.1.1.1. </span>我是五级标题</h6>
<a class="self-link" href="#orgnh-2.1.1.1.1" aria-label="Permalink for Section 2.1.1.1.1"></a>
</div>
<ol class="org-ol">
<li><span id="orgnh-2.1.1.1.1.1"></span>我是六级标题，因为没有 <code>&lt;h7&gt;</code> 所以是列表<br></li>
</ol>
</section>
</section>
</section>
</section>
<section id="orgnh-2.2"><div class="header-wrapper">
<h3 id="x-orgnh-2.2"><span class="secno">2.2. </span>（为了没有缩进，从二级标题开始）</h3>
<a class="self-link" href="#orgnh-2.2" aria-label="Permalink for Section 2.2"></a>
</div>
<p>
在 <code>ox-w3ctr</code> 的 headline 导出中，标题在 HTML 中的级数起始由 <code>org-w3ctr-headline-level</code> 决定。在默认情况下它为 2，对应于 <code>&lt;h2&gt;</code> ， <code>&lt;h1&gt;</code> 留给了整个 HTML 的 <code>title</code> 。 <code>org-w3ctr-headline-level</code> 覆盖了默认确定起始级数的 <code>org-export-headline-levels</code> 。
</p>

<p>
在 org 语法文档中对 headline 的描述如下：
</p>

<pre class="example">
<code>STARS KEYWORD PRIORITY COMMENT TITLE TAGS</code></pre>

<p>
整个 headline 由级数 <code>STARS</code> ，GTD 关键字 <code>KEYWORDS</code> ，优先级 <code>PRIORITY</code> ，注释标志 <code>COMMENT</code> ，标题内容 <code>TITLE</code> 和标签 <code>TAGS</code> 组成。其中 GTD，优先级和标签的导出都是可选的，我使用了三个变量来控制是否导出这些内容，默认情况下都为 <code>nil</code> ，即都不导出：
</p>

<div id="org410ce49" class="example">
<a class="self-link" href="#org410ce49" aria-label="source block"></a>

<pre><code class="src src-emacs-lisp"><span class="ef-cd">;; </span><span class="ef-c">&lt;yy&gt; control todo, priority and tags export
</span>(<span class="ef-b">:with-todo-keywords</span> nil <span class="ef-s">"todo"</span> t-with-todo-keywords)
(<span class="ef-b">:with-priority</span> nil <span class="ef-s">"pri"</span> t-with-priority)
(<span class="ef-b">:with-tags</span> nil <span class="ef-s">"tags"</span> t-with-tags)
...</code></pre></div>

<p>
因为 headline 要求以 <code>*</code> 开头且与行首之间不能有空格，我们也就不能直接在段落的开头使用 <code>*</code> 。对此直接的方法是添加空格或零宽空格，不过正确做法是使用 <code>,</code> 转义，即 <code>,*</code> 。如果我们加载了 <code>org-inlinetask</code> ，那么 <code>*</code> 的数量不应该超过 <code>org-inlinetask-min-level</code> ，它的默认值为 15。
</p>

<p>
标准的 <code>org-todo-keywords</code> 为 <code>((sequence "TODO" "DONE"))</code> ，即默认可用的 <code>KEYWORD</code> 为 <code>"TODO"</code> 和 <code>"DONE"</code> 。读者可以参考 Org 文档的 <a href="https://orgmode.org/manual/TODO-Extensions.html">TODO Extensions</a> 一节来扩展关键字。
</p>

<p>
<code>PRIORITY</code> 可以用来记录 headline 的优先级，默认情况下 Org 支持 <code>[#A]</code>, <code>[#B]</code> 和 <code>[#C]</code> ，不写 <code>PRIORITY</code> 则默认为 <code>[#B]</code> 优先级。优先级的使用可以参考 <a href="https://orgmode.org/manual/Priorities.html">Priorities</a>。
</p>

<p>
<code>TITLE</code> 和 <code>TAGS</code> 没什么好说的，需要注意的是 tag 名不能包含 <code>-</code> 字符。另外 <code>TAGS</code> 的用法可以参考 <a href="https://orgmode.org/manual/Tags.html">Tags</a>。
</p>

<p>
以下是一些和 <code>headline</code> 操作相关的命令：
</p>

<ul class="org-ul">
<li><code>TAB(org-cycle)</code> ，切换 headline 的显示 <a href="https://orgmode.org/manual/Global-and-local-cycling.html">Global and local cycling</a></li>
<li><code>C-c C-n(org-next-visible-heading)</code>, <code>C-c C-p(org-previous-visible-heading)</code>, <code>C-c C-f(org-forward-heading-same-level)</code>, <code>C-c C-b(org-backward-heading-same-level)</code>, <code>C-c C-u(outline-up-heading)</code>, <code>C-c C-j(org-goto)</code> <a href="https://orgmode.org/manual/Motion.html">Motion</a></li>
<li><code>M-LEFT(org-do-promote)</code>, <code>M-RIGHT(org-do-demote)</code>, <code>M-S-LEFT(org-promote-subtree)</code>, <code>M-S-RIGHT(org-demote-subtree)</code>, <code>M-UP(org-move-subtree-up)</code>, <code>M-DOWN(org-move-subtree-down)</code> <a href="https://orgmode.org/manual/Structure-Editing.html">Structure Editing</a></li>
<li><code>C-c C-c(org-set-tags-command)</code> <a href="https://orgmode.org/manual/Setting-Tags.html">Setting Tags</a></li>
</ul>

<p>
最后，文档提到了一些需要注意的点。如果在 <code>STARS</code> 后面紧跟着 <code>COMMENT</code> 字符串的话，整个 heading 会被视为“被注释”状态；如果 headline 带有 <code>ARCHIVE</code> tag，整个 heading 会被视为“归档”状态。这两个单词均需要全大写。我们可使用 <code>C-c ;(org-toggle-comment)</code> 轻松为 headline 添加 <code>COMMENT</code> 。
</p>
</section>
</section>

<section id="orgnh-3"><div class="header-wrapper">
<h2 id="x-orgnh-3"><span class="secno">3. </span>center-block, quote-block, special-block</h2>
<a class="self-link" href="#orgnh-3" aria-label="Permalink for Section 3"></a>
</div>
<p>
<code>center-block</code> 就是让其中内容居中的 block，在语义上有居中含义，不过在 Org-mode buffer 中并不会居中显示。以下是一个 <code>center block</code> 例子（来自 <a href="https://orgmode.org/manual/Paragraphs.html">Paragraphs</a>）：
</p>

<pre class="example">
<code>#+BEGIN_CENTER
Everything should be made as simple as possible, \\
but not any simpler
#+END_CENTER</code></pre>

<p>
其中 <code>\\</code> 表示段落内换行，它的效果如下：
</p>

<div class="org-center">
<p>
Everything should be made as simple as possible, <br>
but not any simpler
</p>
</div>

<p>
类似地， <code>quote block</code> 具有语义上的引用义：
</p>

<pre class="example">
<code>#+BEGIN_QUOTE
你说的对，但是《原神》是由米哈游自主研发的一款全新开放世界冒险游戏。游戏发生在一个被称作「提瓦特」的幻想世界，在这里，被神选中的人将被授予「神之眼」，导引元素之力。你将扮演一位名为「旅行者」的神秘角色，在自由的旅行中邂逅性格各异、能力独特的同伴们，和他们一起击败强敌，找回失散的亲人——同时，逐步发掘「原神」的真相。

你说得对，但是这就是奎桑提，HP 4700，护甲 329，魔抗 201的英雄。有不可阻挡，有护盾，还能过墙。有控制，甚至冷却时间只有1秒，只要15点蓝。转换姿态时甚至可以刷新W的cd，还有真实伤害。然后，护甲和魔抗提升后还能获得技能加速，缩短Q的cd，还缩短释放时间，然后还有攻击力。W就啊啊啊啊啊啊!!!
#+END_QUOTE</code></pre>

<blockquote>
<p>
你说的对，但是《原神》是由米哈游自主研发的一款全新开放世界冒险游戏。游戏发生在一个被称作「提瓦特」的幻想世界，在这里，被神选中的人将被授予「神之眼」，导引元素之力。你将扮演一位名为「旅行者」的神秘角色，在自由的旅行中邂逅性格各异、能力独特的同伴们，和他们一起击败强敌，找回失散的亲人——同时，逐步发掘「原神」的真相。
</p>

<p>
你说得对，但是这就是奎桑提，HP 4700，护甲 329，魔抗 201的英雄。有不可阻挡，有护盾，还能过墙。有控制，甚至冷却时间只有1秒，只要15点蓝。转换姿态时甚至可以刷新W的cd，还有真实伤害。然后，护甲和魔抗提升后还能获得技能加速，缩短Q的cd，还缩短释放时间，然后还有攻击力。W就啊啊啊啊啊啊!!!
</p>
</blockquote>

<p>
所谓 <code>special-block</code> 指的是它的 block 名为其他 org 未定义的名字，比如 <code>#+begin_aside</code> 。变量 <code>org-w3ctr-html5-elements</code> 记录了会被识别为 HTML 标签的名字，如果名字不属于其中的任意一个，那么名字将成为 <code>div</code> 标签的类。在 <code>ox-w3ctr</code> 中 <code>special-block</code> 的绝大部分作用都被 <code>dynamic-block</code> 替代了。
</p>

<div id="org3897c64" class="example">
<a class="self-link" href="#org3897c64" aria-label="source block"></a>
org-w3ctr-html5-elements 的具体定义
<pre><code class="src src-emacs-lisp">(<span class="ef-k">defconst</span> <span class="ef-v">t-html5-elements</span>
  '(<span class="ef-s">"article"</span> <span class="ef-s">"aside"</span> <span class="ef-s">"audio"</span> <span class="ef-s">"canvas"</span> <span class="ef-s">"details"</span> <span class="ef-s">"figcaption"</span> <span class="ef-s">"div"</span>
    <span class="ef-s">"figure"</span> <span class="ef-s">"footer"</span> <span class="ef-s">"header"</span> <span class="ef-s">"menu"</span> <span class="ef-s">"meter"</span> <span class="ef-s">"nav"</span> <span class="ef-s">"noscript"</span>
    <span class="ef-s">"output"</span> <span class="ef-s">"progress"</span> <span class="ef-s">"section"</span> <span class="ef-s">"summary"</span> <span class="ef-s">"video"</span>)
  <span class="ef-d">"Elements in html5.

For blocks that should contain headlines, use the HTML_CONTAINER
property on the headline itself."</span>)</code></pre></div>

<pre class="example">
<code>#+begin_note
This is a note.
#+end_note

#+begin_example
This is an example.
#+end_example

#+begin_issue
This is an issue.
#+end_issue

#+begin_advisement
This is an advisement
#+end_advisement

#+begin_annoying-warning
This is an annoying-warning
#+end_annoying-warning

#+begin_correction
This is a correction
#+end_correction

#+begin_addition
This is an addition
#+end_addition</code></pre>

<div class="note">
<p>
This is a note.
</p>

</div>

<pre>
<code>This is an example.</code></pre>

<div class="issue">
<p>
This is an issue.
</p>

</div>

<div class="advisement">
<p>
This is an advisement
</p>

</div>

<div class="annoying-warning">
<p>
This is an annoying-warning
</p>

</div>

<div class="correction">
<p>
This is a correction
</p>

</div>

<div class="addition">
<p>
This is an addition
</p>

</div>
</section>

<section id="orgnh-4"><div class="header-wrapper">
<h2 id="x-orgnh-4"><span class="secno">4. </span>drawers</h2>
<a class="self-link" href="#orgnh-4" aria-label="Permalink for Section 4"></a>
</div>
</section>
</main>
<p role="navigation" id="back-to-top">
<a href="#title"><abbr title="Back to Top">↑</abbr></a>
</p>
</body>

</html>
